"use client";

import { FC, useState } from "react";
import styles from "../style/cuestion.module.scss";
import { FaAngleDown, FaAngleUp } from "react-icons/fa";

const faqData = [
  {
    question: "Որքա՞ն է տևում տեղադրման գործընթացը:",
    answer:
      "Բնակելի տարածքներում արևային համակարգի տեղադրման համար սովորական ժամանակը 1-ից 3 օր է, երբ բոլոր թույլտվություններն ու հաստատումները պատրաստ են։ Ավելի մեծ կամ առևտրային նախագծերը կարող են ավելի երկար տևել՝ կախված բարդությունից և չափից։",
  },
  {
    question: "Որքա՞ն է արժենում արևային համակարգը։",
    answer:
      "Որքան է տևում տեղադրման գործընթացը: Բնակելի տարածքներում արևային համակարգի տեղադրման համար սովորական ժամանակը 1-ից 3 օր է երբ բոլոր թույլտվություններն ու հաստատումները պատրաստ են: Ավելի մեծ կամ առևտրային նախագծերը կարող են ավելի երկար տևել՝ կախված բարդությունից և չափից Որքան է արժենում արևային համակարգը: Հայաստանում արևային համակարգի արժեքը կախված է օգտագործվող սարքավորումների չափից էներգիայի կարիքներից և տեսակից: Այնուամենայնիվ էլեկտրաէներգիայի վճարների վրա երկարաժամկետ խնայողությունները հաճախ մի քանի տարվա ընթացքում փոխհատուցում են սկզբնական ներդրումը:",
  },
  {
    question: "Արևային վահանակները աշխատո՞ւմ են ամպամած օրերին կամ ձմռանը։",
    answer:
      "Այո՛, արևային վահանակները դեռևս էլեկտրաէներգիա են արտադրում ամպամած օրերին և ձմռանը, թեև մի փոքր նվազեցված արդյունավետությամբ։ Հայաստանի կլիման տարվա ընթացքում բավարար արևի լույս է ապահովում, որպեսզի արևային էներգիան դառնա հուսալի աղբյուր։",
  },
  {
    question: "Արդյո՞ք արևային վահանակների համար անհրաժեշտ է սպասարկում:",
    answer:
      "Արևային համակարգերը պահանջում են նվազագույն սպասարկում: Վահանակների պարբերաբար մաքրումը և համակարգի տարեկան մեկ անգամ ստուգումը սովորաբար բավարար են օպտիմալ աշխատանքն ապահովելու համար: Համակարգերը գալիս են 25+ տարվա երաշխիքով:",
  },
  {
    question:
      "Կարո՞ղ եմ կուտակել արևային վահանակներից ստացված ավելորդ էներգիան։",
    answer:
      "Այո, դուք կարող եք տեղադրել արևային մարտկոցներ՝ չօգտագործված էներգիան կուտակելու համար՝ հետագայում օգտագործելու համար, օրինակ՝ գիշերը կամ էլեկտրաէներգիայի անջատումների ժամանակ: Որպես այլընտրանք, ցանցի հետ կապված համակարգերը կարող են լրացուցիչ էներգիա վերադարձնել ցանցին ցանցային հաշվառման միջոցով:",
  },
];

const Cuestion: FC = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);

  const toggleAccordion = (index: number) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <div className={styles.container}>
      <div className={styles.hachax_container}>
        <h2 className={styles.hachax_h2}>Հաճախ Տրվող Հարցեր</h2>
        <div className={styles.hachax_display}>
          <p className={styles.hachax_p}>
            Սկսած առաջին խորհրդատվությունից մինչև տեղադրումից հետո աջակցություն՝
            մենք ձեզ հետ ենք յուրաքանչյուր փուլում՝ ապահովելու, որ ձեր արևային
            համակարգը լավագույնս աշխատի տասնյակ տարիներ։
          </p>

          <div>
            {faqData.map((item, index) => (
              <div
                key={index}
                className={`${styles.hachax_cub} ${
                  openIndex === index ? styles.open : ""
                }`}
              >
                <div
                  className={styles.hachax_0p_p_p_p}
                  onClick={() => toggleAccordion(index)}
                >
                  <span className={`${openIndex === index &&styles.white }`}>{item.question}</span>
                  <button className={styles.fa_button}>
                    {openIndex === index ? <FaAngleUp /> : <FaAngleDown />}
                  </button>
                </div>

                {openIndex === index && (
                  <div className={styles.answer}>
                    <p>{item.answer}</p>
                  </div>
                )}
              </div>
            ))}
          </div>
        </div>
      </div>
    </div>
  );
};

export default Cuestion;
